{
  "backend/main.mo": "Main Motoko actor implementing a calorie burn tracker with user profiles, activity logging, daily calorie goals, diet plan generation, and access control/blob storage mixins.",
  "feature_evidence.json": "Feature evidence report mapping three workout planner features (mutation hook, results component, planner view/navigation) to their target files and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a reference for the app's component and hook structure.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design tokens for light and dark modes including colors, borders, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML shell for the Vite/React app, mounting the React root and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component rendering a sticky three-tab navigation (Calorie Tracker, AI Diet Planner, Workout Planner) and conditionally displaying CalorieTracker, DietPlannerView, or WorkoutPlannerView based on the active tab and auth state.",
  "frontend/src/components/ActivityForm.tsx": "Form component for logging calorie burn activities with fields for name, duration, and difficulty, auto-calculating calories and submitting via the useAddActivity mutation hook.",
  "frontend/src/components/ActivityList.tsx": "Displays a scrollable, sorted list of calorie-burn activities as cards with difficulty badges, timestamps, and an empty/loading state.",
  "frontend/src/components/CaloriesSummary.tsx": "Shows aggregate stats (total calories, duration, activity count) and a daily goal progress bar fetched via a query hook, with skeleton loading states.",
  "frontend/src/components/DietPlannerForm.tsx": "Form component for selecting a fitness goal and optionally entering user stats (age, weight, height, activity level) before submitting to generate a diet plan.",
  "frontend/src/components/DietPlannerView.tsx": "Top-level view for the AI diet planner that gates access behind Internet Identity authentication and orchestrates form submission, result display, and regeneration.",
  "frontend/src/components/DietPlanResults.tsx": "Renders a generated diet plan including macro breakdown bars, per-meal cards with nutrition details, and regenerate/reset action buttons.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying copyright year and a branded link to caffeine.ai.",
  "frontend/src/components/GoalSettingForm.tsx": "Card form that lets authenticated users set or update their daily calorie burn goal, showing the current goal and using a mutation hook with toast notifications.",
  "frontend/src/components/Header.tsx": "Sticky top navigation header displaying the CalorieBurn logo and a login/logout button that uses Internet Identity authentication state.",
  "frontend/src/components/LoginPrompt.tsx": "Centered card prompting unauthenticated users to sign in via Internet Identity, highlighting security, privacy, and activity tracking features.",
  "frontend/src/components/WorkoutPlannerView.tsx": "Orchestrates the AI workout planner UI: shows a banner, guards with auth state, renders the goal form, and displays results with regenerate/reset support.",
  "frontend/src/components/WorkoutPlanResults.tsx": "Displays a generated workout plan with per-exercise cards, a weekly schedule grid, and options to regenerate or reset the plan.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated (or anonymous) backend actor using TanStack Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity context and hook for managing authentication state (login, logout, identity persistence) via DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines TanStack Query hooks for fetching/mutating activities, daily calorie goals, diet plans, and workout plans against the backend actor.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light/dark themes, including diet and workout planner color schemes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with React Query and Internet Identity providers and mounts it to the DOM.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to extract, persist, and clear URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that maps OKLCH CSS variables to semantic color tokens (primary, accent, diet, workout, sidebar, chart, etc.) and enables typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest describing the CalorieBurn AI fitness app, its existing implemented features (workout plan hook, results component, planner view), and pending feature requests for backend workout plan generation."
}