{
  "backend/main.mo": "Main Motoko actor implementing calorie tracking with user profiles, activity logging, and daily calorie goals, using access control authorization and migration support.",
  "backend/migration.mo": "Migration module that transforms old actor state to new actor state by initializing access control and adding userProfiles and dailyCalorieGoals maps while preserving existing userActivities.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a goal-setting form component with validation and a dashboard summary displaying daily calorie burn goals.",
  "frontend-file-summaries.txt": "JSON summary of frontend files describing React components for authentication, activity tracking, goal setting, and UI styling with OKLCH color system.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes, defining design tokens for backgrounds, borders, and semantic colors.",
  "frontend/index.html": "HTML entry point for the Calorie Burn Tracker application that loads the React app via main.tsx module script.",
  "frontend/src/App.tsx": "Root React component managing authentication state and rendering either a login prompt or the full calorie tracking dashboard with goal setting, activity forms, and activity lists.",
  "frontend/src/components/ActivityForm.tsx": "Form component for logging calorie burn activities with validation for activity name, calories, and duration, using React Query mutation and toast notifications.",
  "frontend/src/components/ActivityList.tsx": "Scrollable list component displaying sorted activities with timestamps, calories, and duration, featuring loading skeletons and empty state handling.",
  "frontend/src/components/CaloriesSummary.tsx": "Displays a summary card showing total calories burned, total duration, activity count, and progress toward a daily calorie goal with loading skeletons and progress bar visualization.",
  "frontend/src/components/Footer.tsx": "Renders a footer component with copyright information and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/GoalSettingForm.tsx": "Provides a form to set and update the user's daily calorie burn goal, displaying the current goal and handling submission with validation and toast notifications.",
  "frontend/src/components/Header.tsx": "Displays the application header with branding (CalorieBurn logo and title) and authentication controls (login/logout button based on Internet Identity authentication state).",
  "frontend/src/components/LoginPrompt.tsx": "Shows a login prompt card with feature highlights (secure authentication, privacy, progress tracking) and a sign-in button for unauthenticated users.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks, managing AuthClient creation, login/logout flows, identity persistence, and authentication status throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching activities, adding activities, getting daily calorie goals, and setting daily calorie goals with automatic cache invalidation.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for theming (light and dark modes) including colors for backgrounds, borders, primary/accent colors, and sidebar components.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended theme properties, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking file documenting a calorie burn tracking app with existing features (activity logging, goal setting, authentication) and pending feature requests."
}